jimmywong2003/nrf52-ble-range-estimator/ble_central_long_range_demo_kit/main.c
static void display_update(void);
app_display_content_t m_application_state = {0};                                   /**< Struct containing the dynamic content of the display */



BLE_NUS_C_DEF(m_ble_nus_c);                                             /**< BLE Nordic UART Service (NUS) client instance. */
NRF_BLE_GATT_DEF(m_gatt);                                               /**< GATT module instance. */
BLE_DB_DISCOVERY_DEF(m_db_disc);                                        /**< Database discovery module instance. */
NRF_BLE_SCAN_DEF(m_scan);                                               /**< Scanning Module instance. */

BLE_ITS_C_ARRAY_DEF(m_ble_its_c, NRF_SDH_BLE_CENTRAL_LINK_COUNT); /**< BLE Nordic Image Transfer Service (ITS) client instance. */

BLE_FTS_C_DEF(m_ble_fts_c); /**< BLE Nordic File Transfer Service (FTS) client instance. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static uint16_t m_ble_its_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static uint16_t m_ble_fts_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */


#define FAST_BLINK_INTERVAL   APP_TIMER_TIKCS(200)
APP_TIMER_DEF(m_scan_slow_blink_timer_id);                    /**< Timer used to toggle LED for "scan mode" indication on the dev.kit. */

#define SLOW_BLINK_INTERVAL   APP_TIMER_TICKS(750)
APP_TIMER_DEF(m_1Mbps_led_slow_blink_timer_id);                /**< Timer used to toggle LED for phy selection indication on the dev.kit. */
APP_TIMER_DEF(m_8dBm_led_slow_blink_timer_id);                 /**< Timer used to toggle LED for output power selection indication on the dev.kit. */
APP_TIMER_DEF(m_time_keeper_timer_id);                         /**< Timer used to make sure app_timer runs continuously. Used by the log module.*/

static uint8_t rssi_count = 0;

/**@brief Names which the central applications will scan for, and which will be advertised by the peripherals.
 *  if these are set to empty strings, the UUIDs defined below will be used
 */
static char const m_target_periph_name[] = "DeviceUART";      /**< If you want to connect to a peripheral using a given advertising name, type its name here. */
static bool is_connect_per_addr = true;            /**< If you want to connect to a peripheral with a given address, set this to true and put the correct address in the variable below. */


static ble_gap_addr_t const m_target_periph_addr =
{
        /* Possible values for addr_type:
           BLE_GAP_ADDR_TYPE_PUBLIC,
           BLE_GAP_ADDR_TYPE_RANDOM_STATIC,
           BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE,
           BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE. */
        .addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC,
        .addr = {0xC3, 0x11, 0x11, 0x11, 0x11, 0xFF}
};

/**@brief NUS UUID. */
static ble_uuid_t const m_nus_uuid =
{
        .uuid = BLE_UUID_NUS_SERVICE,
        .type = NUS_SERVICE_UUID_TYPE
};

/**< Scan parameters requested for scanning and connection. */
static ble_gap_scan_params_t const m_scan_param_coded_phy =
{
        .extended       = 1,
        .active        = 0x01,
        .interval      = NRF_BLE_SCAN_SCAN_INTERVAL,
        .window        = NRF_BLE_SCAN_SCAN_WINDOW,
        .filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL,
        .timeout       = SCAN_DURATION_WITHOUT_WHITELIST,
        .scan_phys     = BLE_GAP_PHY_CODED,
        .report_incomplete_evts = 0,
};

/**< Scan parameters requested for scanning and connection. */
static ble_gap_scan_params_t const m_scan_param_1MBps =
{
        .active        = 0x01,
        .interval      = NRF_BLE_SCAN_SCAN_INTERVAL,
        .window        = NRF_BLE_SCAN_SCAN_WINDOW,
        .filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL,
        .timeout       = SCAN_DURATION_WITHOUT_WHITELIST,
        .scan_phys     = BLE_GAP_PHY_1MBPS,
};

static void scan_start(void);

/********************************************************************************/
/********************************************************************************/
/********************************************************************************/
/********************************************************************************/
/********************************************************************************/
/********************************************************************************/
/********************************************************************************/
/********************************************************************************/


/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function is called in case of an assert in the SoftDevice.
 *
 * @warning This handler is only an example and is not meant for the final product. You need to analyze
 *          how your product is supposed to react in case of assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing assert call.
 * @param[in] p_file_name  File name of the failing assert call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

/**@brief Function for starting scanning. */
static void scan_start(void)
{
        ret_code_t ret;

        // Set the correct TX power.
        ret = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, NULL, m_output_power_selected);
        APP_ERROR_CHECK(ret);

        NRF_LOG_INFO("Output power set to %d dBm", m_output_power_selected);

        switch(m_adv_scan_phy_selected)
        {
        case SELECTION_CODED_PHY:
        {
                NRF_LOG_INFO("Starting scan on coded phy.");
                ret = nrf_ble_scan_params_set(&m_scan, &m_scan_param_coded_phy);
                APP_ERROR_CHECK(ret);
                break;
        }
        case SELECTION_1M_PHY:
        {
                NRF_LOG_INFO("Starting scan on 1Mbps.");
                ret = nrf_ble_scan_params_set(&m_scan, &m_scan_param_1MBps);
                APP_ERROR_CHECK(ret);
                break;
        }
        default:
        {
                NRF_LOG_INFO("Phy selection did not match setup. Scan not started.");
        }
        break;

