jimmywong2003/nrf52-ble-range-estimator/ble_central_long_range_demo_kit/main.c
        case BLE_NUS_C_EVT_NUS_TX_EVT:
                ble_nus_chars_received_uart_print(p_ble_nus_evt->p_data, p_ble_nus_evt->data_len);
                break;

        case BLE_NUS_C_EVT_DISCONNECTED:
                NRF_LOG_INFO("Disconnected.");
                scan_start();
                break;
        }
}
/**@snippet [Handling events from the ble_nus_c module] */

static void ble_its_c_evt_handler(ble_its_c_t *p_ble_its_c, ble_its_c_evt_t const *p_ble_its_evt)
{
        ret_code_t err_code;
        uint32_t receive_byte = 0;

        switch (p_ble_its_evt->evt_type)
        {
        case BLE_ITS_C_EVT_DISCOVERY_COMPLETE:
                NRF_LOG_DEBUG("ITS Service: Discovery complete.");
                err_code = ble_its_c_handles_assign(p_ble_its_c, p_ble_its_evt->conn_handle, &p_ble_its_evt->handles);
                APP_ERROR_CHECK(err_code);

                NRF_LOG_DEBUG("ITS Notification is enabled!!");
                err_code = ble_its_c_tx_notif_enable(p_ble_its_c);
                APP_ERROR_CHECK(err_code);

                NRF_LOG_DEBUG("ITS Image Notification is enabled !!!");
                err_code = ble_its_c_img_info_notif_enable(p_ble_its_c);
                APP_ERROR_CHECK(err_code);

                NRF_LOG_INFO("Connected to device with Nordic ITS Service.");
                break;

        case BLE_ITS_C_EVT_ITS_TX_EVT:
                NRF_LOG_INFO("ITS Receive the number of bytes = %04d", receive_byte);
                //NRF_LOG_DEBUG("BLE_ITS_C_EVT_ITS_TX_EVT %04d", receive_byte);
                break;

        case BLE_ITS_C_EVT_ITS_IMG_INFO_EVT:
                //NRF_LOG_INFO("ITS Image Info: the number of bytes = %04d", receive_byte);
                //NRF_LOG_DEBUG("BLE_ITS_C_EVT_ITS_IMG_INFO_EVT %04d", receive_byte);
                break;

        case BLE_ITS_C_EVT_ITS_RX_COMPLETE_EVT:
                NRF_LOG_INFO("RX COMPLETE");
                // m_counter_get = counter_get();

                break;

        case BLE_ITS_C_EVT_DISCONNECTED:
                NRF_LOG_INFO("Disconnected.");
                //scan_start();
                break;
        }
}


static void ble_fts_c_evt_handler(ble_fts_c_t *p_ble_fts_c, ble_fts_c_evt_t const *p_ble_fts_evt)
{
        ret_code_t err_code;

        switch (p_ble_fts_evt->evt_type)
        {
        case BLE_EVT_FTS_C_DISCOVERY_COMLETE:
                NRF_LOG_DEBUG("FTS Service: Discovery complete.");
                err_code = ble_fts_c_handles_assign(p_ble_fts_c, p_ble_fts_evt->conn_handle, &p_ble_fts_evt->handles);
                APP_ERROR_CHECK(err_code);

                NRF_LOG_DEBUG("FTS Data Notification is enabled!!");
                err_code = ble_fts_c_tx_data_notif_enable(p_ble_fts_c);
                APP_ERROR_CHECK(err_code);

                NRF_LOG_DEBUG("FTS Command Notification is enabled !!!");
                err_code = ble_fts_c_tx_cmd_notif_enable(p_ble_fts_c);
                APP_ERROR_CHECK(err_code);

                NRF_LOG_INFO("Connected to device with Nordic FTS Service.");
                break;

        case BLE_EVT_FTS_C_TX_DATA:               /**< Event indicating that the central has received data something from a peer. */
                NRF_LOG_INFO("BLE_EVT_FTS_C_TX_DATA");
                NRF_LOG_INFO("Receive data from device");
                NRF_LOG_HEXDUMP_INFO(p_ble_fts_evt->p_data, p_ble_fts_evt->data_len);

                break;

        case BLE_EVT_FTS_C_TX_CMD:                       /**< Event indicating that the central has received command something from a peer. */
                NRF_LOG_INFO("BLE_EVT_FTS_C_TX_CMD");
                NRF_LOG_INFO("Receive cmd from device");
                NRF_LOG_HEXDUMP_INFO(p_ble_fts_evt->p_data, p_ble_fts_evt->data_len);

                break;
        case BLE_EVT_FTS_C_RX_CMD:
                NRF_LOG_INFO("BLE_EVT_FTS_C_RX_CMD");
                NRF_LOG_HEXDUMP_INFO(p_ble_fts_evt->p_data, p_ble_fts_evt->data_len);
                break;

        case BLE_EVT_FTS_C_RX_DATA:
                NRF_LOG_INFO("BLE_EVT_FTS_C_RX_DATA");
                NRF_LOG_HEXDUMP_INFO(p_ble_fts_evt->p_data, p_ble_fts_evt->data_len);
                break;

        case BLE_EVT_FTS_C_RX_DATA_COMPLETE:               /**< Event indicating that the central has written data to peripheral completely. */
                NRF_LOG_INFO("BLE_EVT_FTS_C_RX_DATA_COMPLETE");
                break;

        case BLE_EVT_FTS_C_CONNECTED:
                break;

        case BLE_EVT_FTS_C_DISCONNECTED:
                NRF_LOG_INFO("Disconnected.");

                break;
        }
}



/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
        ret_code_t err_code;
        ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:
                err_code = ble_nus_c_handles_assign(&m_ble_nus_c, p_ble_evt->evt.gap_evt.conn_handle, NULL);
                APP_ERROR_CHECK(err_code);

                err_code = ble_its_c_handles_assign(&m_ble_its_c[p_gap_evt->conn_handle], p_gap_evt->conn_handle, NULL);
                APP_ERROR_CHECK(err_code);

                err_code = ble_fts_c_handles_assign(&m_ble_fts_c, p_gap_evt->conn_handle, NULL);
                APP_ERROR_CHECK(err_code);

                err_code = sd_ble_gap_rssi_start(p_ble_evt->evt.gap_evt.conn_handle, 1, 2);
                APP_ERROR_CHECK(err_code);

                m_application_state.app_state = APP_STATE_CONNECTED;
                display_update();

                err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
                APP_ERROR_CHECK(err_code);

                m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                // start discovery of services. The NUS Client waits for a discovery result
                err_code = ble_db_discovery_start(&m_db_disc, p_ble_evt->evt.gap_evt.conn_handle);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GAP_EVT_DISCONNECTED:

