jimmywong2003/nrf52-ble-range-estimator/ble_central_long_range_demo_kit/main.c
/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
        NRF_LOG_DEBUG("call to ble_lbs_on_db_disc_evt for instance %d and link 0x%x!",
                      p_evt->conn_handle,
                      p_evt->conn_handle);
        ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
        ble_its_c_on_db_disc_evt(&m_ble_its_c[p_evt->conn_handle], p_evt);
        ble_fts_c_on_db_disc_evt(&m_ble_fts_c, p_evt);
}


/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
        ret_code_t err_code;

        err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, NRF_SDH_BLE_GAP_DATA_LENGTH);
        APP_ERROR_CHECK(err_code);
}

///**@brief Function setting the internal scan state.
// * Note: this function sets the internal "scan selection state", it does not start scanning.
// *       The new scan mode will be used when (re-)starting to scan.
// */
//static void scan_selection_state_set(scan_type_selection_t scan_selection)
//{
//        ret_code_t err_code;
//
//        m_scan_type_selected = scan_selection;
//        bsp_board_led_off(ADV_REPORT_LED);
//        switch (scan_selection)
//        {
//        case SELECTION_SCAN_CONN:
//        {
//                // Current state is scanning,  trying to connect. Turn on associated LED.
//                // err_code = app_timer_stop(m_scan_slow_blink_timer_id);
//                // APP_ERROR_CHECK(err_code);
//
//                bsp_board_led_on(SCAN_LED);
//                NRF_LOG_INFO("Scan mode set: scanning, trying to connect. Will be applied when scanning is re-started.");
//
//        } break;
//
//        case SELECTION_SCAN_NON_CONN:
//        {
//
//                // Current state is scanning, not trying to connect. Start blinking associated LED
//                // err_code = app_timer_start(m_scan_slow_blink_timer_id, SLOW_BLINK_INTERVAL, NULL);
//                // APP_ERROR_CHECK(err_code);
//
//                NRF_LOG_INFO("Scan mode set: scanning only. Will be applied when scanning is re-started.");
//        } break;
//        }
//
//}

/**@brief Function for setting new output power selection: LEDs start to blink according to the selected state.
 * Note: this function sets the output power/TX power.
 *       The new output power will be set when (re-)starting to scan.
 */

static void output_power_selection_set(output_power_selection_t output_power)
{
        ret_code_t err_code;
        m_output_power_selected = output_power;

        switch ( m_output_power_selected)
        {
        case SELECTION_8_dBm:
        {
                // 8 dBm is the current output power, start blinking LED.
                bsp_board_led_off(OUTPUT_POWER_SELECTION_LED); // not necessary because the LED should start to blink.
                // err_code = app_timer_start(m_8dBm_led_slow_blink_timer_id, SLOW_BLINK_INTERVAL, NULL);
                // APP_ERROR_CHECK(err_code);
        } break;

        case SELECTION_0_dBm:
        {
                // // 0 dBm is the current output power, turn on LED.
                // err_code = app_timer_stop(m_8dBm_led_slow_blink_timer_id);
                // APP_ERROR_CHECK(err_code);
                bsp_board_led_on(OUTPUT_POWER_SELECTION_LED);
        } break;
        }

        if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
        {
                scan_start();
        }

}


/**@brief Function for switching PHY: coded phy or 1 Mbps
 * Note: this function does only set the internal state, it does apply the new setting.
 *       The new phy will be be used when (re-)starting scanning.
 */
static void on_phy_selection_button(void)
{
        // Change the selected phy.
        adv_scan_phy_selection_t new_phy_selection;
        switch (m_adv_scan_phy_selected)
        {
        case SELECTION_CODED_PHY: // SELECTION_CODED_PHY is the previous "state".
        {
                // 1 Mbps is the current state, LED should start blinking.
                new_phy_selection = SELECTION_1M_PHY;
        } break;

        case SELECTION_1M_PHY:
        {
                // Coded phy is the current sate, turn on LED.
                new_phy_selection = SELECTION_CODED_PHY;
        } break;
        }
        //phy_selection_set_state(new_phy_selection);


        if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
        {
                m_adv_scan_phy_selected = new_phy_selection;
                scan_start();
        }
}


/**@brief Function for switching output power/TX power: 0 dBm or 8 dBm.
 * Note:  this function does only set the internal state, it does apply the new setting.
 *        The new output power will be set when (re-)starting to scan.
 */
static void on_output_power_selection_button(void)
{
        // Change the output power.
        output_power_selection_t new_output_power;
        switch ( m_output_power_selected)
        {
        case SELECTION_0_dBm: // 0 dBm is the previous output power.
        {
                // 8 dBm is the current output power, start blinking LED.
                new_output_power = SELECTION_8_dBm;

        } break;

        case SELECTION_8_dBm:
        {
                // 0 dBm is the current output power, turn on LED.
                new_output_power = SELECTION_0_dBm;

        } break;

        }
        output_power_selection_set(new_output_power);

}


static void display_update()
{
        static bool first_update = true;
        if(first_update)
        {
                m_application_state.main_title = "Central LRange";
                app_display_create_main_screen(&m_application_state);
                first_update = false;
        }
        else
        {
                app_display_update_main_screen(&m_application_state);
        }
        app_display_update();
}


