jimmywong2003/nrf52-ble-range-estimator/ble_central_long_range_demo_kit/main.c
static void ble_go_to_idle(void)
{
        ret_code_t err_code;

        NRF_LOG_INFO("%s : App_state %d", m_application_state.app_state);
        switch(m_application_state.app_state)
        {
        case APP_STATE_SCANNING:
                NRF_LOG_INFO("Scanning Stop");
                nrf_ble_scan_stop();
                break;

        case APP_STATE_CONNECTED:
                if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                        APP_ERROR_CHECK(err_code);
                }
                break;

                // case APP_STATE_DISCONNECTED:
                //         err_code = app_timer_stop(m_restart_advertising_timer_id);
                //         APP_ERROR_CHECK(err_code);
                //         break;
        }
        m_application_state.app_state = APP_STATE_IDLE;
        display_update();
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
        ret_code_t err_code;

        switch (pin_no)
        {

        case PHY_SELECTION_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        NRF_LOG_INFO("PHY_SELECTION_BUTTON");
                        on_phy_selection_button();
                        display_update();
                        m_application_state.phy = (m_application_state.phy + 1) % APP_PHY_LIST_END;
                }
                break;

        case OUTPUT_POWER_SELECTION_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        NRF_LOG_INFO("OUTPUT_POWER_SELECTION_BUTTON");
                        on_output_power_selection_button();
                        m_application_state.tx_power = (m_application_state.tx_power + 1) % 3;
                        int8_t tx_power = (int8_t)(m_application_state.tx_power * 4);
                        // if(m_application_state.app_state == APP_STATE_CONNECTED)
                        // {
                        //         err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, tx_power);
                        //         APP_ERROR_CHECK(err_code);
                        //         NRF_LOG_INFO("TX Power for Connection: %d", tx_power);
                        // }
                        // else
                        // {
                        //         err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, tx_power);
                        //         APP_ERROR_CHECK(err_code);
                        //         NRF_LOG_INFO("TX Power for Advertising: %d", tx_power);
                        // }


                        display_update();
                }
                break;

        case SCAN_SELECTION_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        NRF_LOG_INFO("SCAN_SELECTION_BUTTON");
//                        if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
//                        {
//                                scan_start();
//                        }
                        if(m_application_state.app_state == APP_STATE_IDLE)
                        {
                                scan_start();
                        }
                        else
                        {
                                ble_go_to_idle();
                        }
                }
                break;
        case CHANNEL_MAP_SURVEY_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {


                }
                break;

        // case HOST_RX_DATA_SEND_BUTTON:
        //         if (button_action == APP_BUTTON_PUSH)
        //         {
        //                 NRF_LOG_INFO("HOST_RX_DATA_SEND_BUTTON");
        //                 if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        //                 {
        //                         // err_code = module_background_dfu_host_ota_start_request();
        //                         // APP_ERROR_CHECK(err_code);
        //                         uint8_t cmd_buffer[] = { 0x01, 0x02, 0x03 };
        //                         err_code = ble_fts_c_rx_cmd_send(&m_ble_fts_c,cmd_buffer, sizeof(cmd_buffer));
        //                         APP_ERROR_CHECK(err_code);
        //                 }
        //         }
        //         break;
        // case HOST_RX_CMD_SEND_BUTTON:
        //         if (button_action == APP_BUTTON_PUSH)
        //         {
        //                 NRF_LOG_INFO("HOST_RX_CMD_SEND_BUTTON");
        //                 if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        //                 {
        //                         // err_code = module_background_dfu_host_ota_start_request();
        //                         // APP_ERROR_CHECK(err_code);
        //                         uint8_t cmd_buffer[] = { 0x31, 0x33, 0x35 };
        //                         err_code = ble_fts_c_rx_data_send(&m_ble_fts_c,cmd_buffer, sizeof(cmd_buffer));
        //                         APP_ERROR_CHECK(err_code);
        //                 }
        //         }
        //         break;


        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                // {HOST_RX_DATA_SEND_BUTTON, false, BUTTON_PULL, button_event_handler},
                // {HOST_RX_CMD_SEND_BUTTON,  false, BUTTON_PULL, button_event_handler},
                {PHY_SELECTION_BUTTON, false, BUTTON_PULL, button_event_handler},
                {OUTPUT_POWER_SELECTION_BUTTON,  false, BUTTON_PULL, button_event_handler},
                {SCAN_SELECTION_BUTTON, false, BUTTON_PULL, button_event_handler},
                {CHANNEL_MAP_SURVEY_BUTTON, false, BUTTON_PULL, button_event_handler}
        };

        err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);

